#### Terraform Format and Style 🖌`success`

#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


terraform
[0m[1mmodule.kube-hetzner.random_password.k3s_token: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.random_password.rancher_bootstrap[0]: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1039124][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=100076577][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1039125][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2265572][0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11230579][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 0s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 0s [id=229419124][0m
[0m[1mmodule.kube-hetzner.local_file.kustomization_backup[0]: Refreshing state... [id=8e7f0c3795b75dc16a19e7c31d84c4be75b8f725][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 0s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11230579-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11230579-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11230579-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11230579-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].hcloud_server_network.server[0]: Refreshing state... [id=101380064-11230579][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].hcloud_server_network.server[0]: Refreshing state... [id=101380403-11230579][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].hcloud_server_network.server[0]: Refreshing state... [id=101380404-11230579][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].random_string.identity_file: Refreshing state... [id=flwdgpmqw8jclcldtjru][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].random_string.identity_file: Refreshing state... [id=feo1r3js58afgh5uor71][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].random_string.identity_file: Refreshing state... [id=y8op1b7apozcin01djjo][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].random_string.server: Refreshing state... [id=xsm][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].random_string.server: Refreshing state... [id=khz][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].random_string.server: Refreshing state... [id=vwm][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].hcloud_server_network.server[0]: Refreshing state... [id=101380061-11230579][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].random_string.server: Refreshing state... [id=rmz][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].random_string.identity_file: Refreshing state... [id=zbrj58fil107g7vqdywx][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].hcloud_server.server: Refreshing state... [id=101380403][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].hcloud_server.server: Refreshing state... [id=101380404][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].hcloud_server.server: Refreshing state... [id=101380064][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].hcloud_server.server: Refreshing state... [id=101380061][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].null_resource.registries: Refreshing state... [id=6866925766574831250][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].null_resource.zram: Refreshing state... [id=646964534705101758][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].null_resource.os_upgrade_toggle: Refreshing state... [id=7789014151608545338][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].null_resource.registries: Refreshing state... [id=8196842493281666163][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].null_resource.registries: Refreshing state... [id=4378927742574068351][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].null_resource.registries: Refreshing state... [id=7631491688707988452][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].null_resource.zram: Refreshing state... [id=7652979479700232142][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].null_resource.zram: Refreshing state... [id=5520028435006268066][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].null_resource.zram: Refreshing state... [id=5300602873555483926][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-agent-large-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=7502888416204859927][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-agent-medium-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=837972810883620645][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-agent-small-1"].null_resource.os_upgrade_toggle: Refreshing state... [id=9017805280452989953][0m
[0m[1mmodule.kube-hetzner.null_resource.first_control_plane: Refreshing state... [id=4007826674005214149][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["1-0-agent-medium-1"]: Refreshing state... [id=8156232196281666115][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["0-0-agent-small-1"]: Refreshing state... [id=6858621347433014523][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["2-0-agent-large-1"]: Refreshing state... [id=4568912841359235763][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-fsn1"]: Refreshing state... [id=4030096260709267441][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["0-0-control-plane-fsn1"]: Refreshing state... [id=2764144488118733613][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["0-0-agent-small-1"]: Refreshing state... [id=1917346749742104852][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["2-0-agent-large-1"]: Refreshing state... [id=8543770361867571850][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["1-0-agent-medium-1"]: Refreshing state... [id=8733860815117282401][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["0-0-control-plane-fsn1"]: Refreshing state... [id=8283717252958160176][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization: Refreshing state... [id=5668419053028797038][0m
[0m[1mmodule.kube-hetzner.local_sensitive_file.kubeconfig[0]: Refreshing state... [id=e16e620961a153f39a17db3d20c4cc44fba99794][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.kube-hetzner.hcloud_ssh_key.k3s[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_ssh_key" "k3s" {
      [33m~[0m[0m fingerprint = "ff:e4:e9:7f:63:ea:f0:d6:69:8b:58:67:a5:63:4f:c9" -> (known after apply)
      [33m~[0m[0m id          = "100076577" -> (known after apply)
        name        = "kube-baphomet"
      [33m~[0m[0m public_key  = <<-EOT [31m# forces replacement[0m[0m
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKC6jxq2Lbiwe4cjcB8itTmh4a6ldDR2KVGSM2PvrZwb sandro@DESKTOP-E6TGITL
        EOT
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.kustomization[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "null_resource" "kustomization" {
      [33m~[0m[0m id       = "5668419053028797038" -> (known after apply)
      [33m~[0m[0m triggers = { [31m# forces replacement[0m[0m
          [33m~[0m[0m "helm_values_yaml" = (sensitive value)
            [90m# (3 unchanged elements hidden)[0m[0m
        }
    }

[1m  # module.kube-hetzner.ssh_sensitive_resource.kubeconfig[0m will be created
[0m  [32m+[0m[0m resource "ssh_sensitive_resource" "kubeconfig" {
      [32m+[0m[0m agent                              = (sensitive value)
      [32m+[0m[0m bastion_port                       = "22"
      [32m+[0m[0m commands                           = [
          [32m+[0m[0m "cat /etc/rancher/k3s/k3s.yaml",
        ]
      [32m+[0m[0m commands_after_file_changes        = true
      [32m+[0m[0m host                               = "5.75.224.184"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ignore_no_supported_methods_remain = false
      [32m+[0m[0m port                               = "22"
      [32m+[0m[0m private_key                        = (sensitive value)
      [32m+[0m[0m result                             = (sensitive value)
      [32m+[0m[0m retry_delay                        = "10s"
      [32m+[0m[0m timeout                            = "15m"
      [32m+[0m[0m user                               = "root"
      [32m+[0m[0m when                               = "create"
    }

[1m  # module.kube-hetzner.module.agents["0-0-agent-small-1"].data.cloudinit_config.config[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                            >&2 echo "loop"
                            if (( "$SECONDS" > "$END_SECONDS" )); then
                                >&2 echo "timeout reached"
                                exit 1
                            fi
                            # run command and check return code
                            if $@ ; then
                                >&2 echo "break"
                                break
                            else
                                >&2 echo "got failure exit code, repeating"
                                sleep 0.5
                            fi
                        done
                    }
                
                    myrename () {
                        local eth="$1"
                        local eth_connection
                
                        # In case of a private-only network, eth0 may not exist
                        if ip link show "$eth" &>/dev/null; then
                            eth_connection=$(nmcli -g GENERAL.CONNECTION device show "$eth" || echo '')
                            nmcli connection modify "$eth_connection" \
                              con-name "$eth" \
                              connection.interface-name "$eth"
                        fi
                    }
                
                    myrepeat myrename eth0
                    myrepeat myrename eth1
                
                    systemctl restart NetworkManager
                  permissions: "0744"
                
                # Disable ssh password authentication
                - content: |
                    Port 22
                    PasswordAuthentication no
                    X11Forwarding no
                    MaxAuthTries 2
                    AllowTcpForwarding no
                    AllowAgentForwarding no
                    AuthorizedKeysFile .ssh/authorized_keys
                  path: /etc/ssh/sshd_config.d/kube-hetzner.conf
                
                # Set reboot method as "kured"
                - content: |
                    REBOOT_METHOD=kured
                  path: /etc/transactional-update.conf
                
                # Create Rancher repo config
                - content: |
                    [rancher-k3s-common-stable]
                    name=Rancher K3s Common (stable)
                    baseurl=https://rpm.rancher.io/k3s/stable/common/microos/noarch
                    enabled=1
                    gpgcheck=1
                    repo_gpgcheck=0
                    gpgkey=https://rpm.rancher.io/public.key
                  path: /etc/zypp/repos.d/rancher-k3s-common.repo
                
                # Create the kube_hetzner_selinux.te file, that allows in SELinux to not interfere with various needed services
                - path: /root/kube_hetzner_selinux.te
                  content: |
                    module kube_hetzner_selinux 1.0;
                
                    require {
                        type kernel_t, bin_t, kernel_generic_helper_t, iscsid_t, iscsid_exec_t, var_run_t, var_lib_t,
                            init_t, unlabeled_t, systemd_logind_t, systemd_hostnamed_t, container_t,
                            cert_t, container_var_lib_t, etc_t, usr_t, container_file_t, container_log_t,
                            container_share_t, container_runtime_exec_t, container_runtime_t, var_log_t, proc_t, io_uring_t, fuse_device_t, http_port_t,
                            container_var_run_t;
                        class key { read view };
                        class file { open read execute execute_no_trans create link lock rename write append setattr unlink getattr watch };
                        class sock_file { watch write create unlink };
                        class unix_dgram_socket create;
                        class unix_stream_socket { connectto read write };
                        class dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write watch };
                        class lnk_file { read create };
                        class system module_request;
                        class filesystem associate;
                        class bpf map_create;
                        class io_uring sqpoll;
                        class anon_inode { create map read write };
                        class tcp_socket name_connect;
                        class chr_file { open read write };
                    }
                
                    #============= kernel_generic_helper_t ==============
                    allow kernel_generic_helper_t bin_t:file execute_no_trans;
                    allow kernel_generic_helper_t kernel_t:key { read view };
                    allow kernel_generic_helper_t self:unix_dgram_socket create;
                
                    #============= iscsid_t ==============
                    allow iscsid_t iscsid_exec_t:file execute;
                    allow iscsid_t var_run_t:sock_file write;
                    allow iscsid_t var_run_t:unix_stream_socket connectto;
                
                    #============= init_t ==============
                    allow init_t unlabeled_t:dir { add_name remove_name rmdir search };
                    allow init_t unlabeled_t:lnk_file create;
                    allow init_t container_t:file { open read };
                    allow init_t container_file_t:file { execute execute_no_trans };
                    allow init_t fuse_device_t:chr_file { open read write };
                    allow init_t http_port_t:tcp_socket name_connect;
                
                    #============= systemd_logind_t ==============
                    allow systemd_logind_t unlabeled_t:dir search;
                
                    #============= systemd_hostnamed_t ==============
                    allow systemd_hostnamed_t unlabeled_t:dir search;
                
                    #============= container_t ==============
                    allow container_t { cert_t container_log_t }:dir read;
                    allow container_t { cert_t container_log_t }:lnk_file read;
                    allow container_t cert_t:file { read open };
                    allow container_t container_var_lib_t:dir { add_name remove_name write read create };
                    allow container_t container_var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t etc_t:dir { add_name remove_name write create setattr watch };
                    allow container_t etc_t:file { create setattr unlink write };
                    allow container_t etc_t:sock_file { create unlink };
                    allow container_t usr_t:dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write };
                    allow container_t usr_t:file { append create execute getattr link lock read rename setattr unlink write };
                    allow container_t container_file_t:file { open read write append getattr setattr lock };
                    allow container_t container_file_t:sock_file watch;
                    allow container_t container_log_t:file { open read write append getattr setattr watch };
                    allow container_t container_share_t:dir { read write add_name remove_name };
                    allow container_t container_share_t:file { read write create unlink };
                    allow container_t container_runtime_exec_t:file { read execute execute_no_trans open };
                    allow container_t container_runtime_t:unix_stream_socket { connectto read write };
                    allow container_t kernel_t:system module_request;
                    allow container_t var_log_t:dir { add_name write remove_name watch read };
                    allow container_t var_log_t:file { create lock open read setattr write unlink getattr };
                    allow container_t var_lib_t:dir { add_name remove_name write read create };
                    allow container_t var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t proc_t:filesystem associate;
                    allow container_t self:bpf map_create;
                    allow container_t self:io_uring sqpoll;
                    allow container_t io_uring_t:anon_inode { create map read write };
                    allow container_t container_var_run_t:dir { add_name remove_name write };
                    allow container_t container_var_run_t:file { create open read rename unlink write };
                
                # Create the k3s registries file if needed
                
                # Create k3s registries file
                - content: IA==
                  encoding: base64
                  path: /etc/rancher/k3s/registries.yaml
                
                
                
                # Apply DNS config
                manage_resolv_conf: true
                resolv_conf:
                  nameservers:
                    - 8.8.8.8
                    - 2606:4700:4700::1111
                
                # Add ssh authorized keys
                ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKC6jxq2Lbiwe4cjcB8itTmh4a6ldDR2KVGSM2PvrZwb sandro@DESKTOP-E6TGITL
                
                # Resize /var, not /, as that's the last partition in MicroOS image.
                growpart:
                    devices: ["/var"]
                
                # Make sure the hostname is set correctly
                hostname: kube-baphomet-agent-small-1-khz
                preserve_hostname: true
                
                runcmd:
                
                # ensure that /var uses full available disk size, thanks to btrfs this is easy
                - [btrfs, 'filesystem', 'resize', 'max', '/var']
                
                # SELinux permission for the SSH alternative port
                
                
                # Create and apply the necessary SELinux module for kube-hetzner
                - [checkmodule, '-M', '-m', '-o', '/root/kube_hetzner_selinux.mod', '/root/kube_hetzner_selinux.te']
                - ['semodule_package', '-o', '/root/kube_hetzner_selinux.pp', '-m', '/root/kube_hetzner_selinux.mod']
                - [semodule, '-i', '/root/kube_hetzner_selinux.pp']
                - [setsebool, '-P', 'virt_use_samba', '1']
                - [setsebool, '-P', 'domain_kernel_load_modules', '1']
                
                # Disable rebootmgr service as we use kured instead
                - [systemctl, disable, '--now', 'rebootmgr.service']
                
                # Bounds the amount of logs that can survive on the system
                - [sed, '-i', 's/#SystemMaxUse=/SystemMaxUse=3G/g', /etc/systemd/journald.conf]
                - [sed, '-i', 's/#MaxRetentionSec=/MaxRetentionSec=1week/g', /etc/systemd/journald.conf]
                
                # Reduces the default number of snapshots from 2-10 number limit, to 4 and from 4-10 number limit important, to 2
                - [sed, '-i', 's/NUMBER_LIMIT="2-10"/NUMBER_LIMIT="4"/g', /etc/snapper/configs/root]
                - [sed, '-i', 's/NUMBER_LIMIT_IMPORTANT="4-10"/NUMBER_LIMIT_IMPORTANT="3"/g', /etc/snapper/configs/root]
                
                # Allow network interface
                - [chmod, '+x', '/etc/cloud/rename_interface.sh']
                
                # Restart the sshd service to apply the new config
                - [systemctl, 'restart', 'sshd']
                
                # Make sure the network is up
                - [systemctl, restart, NetworkManager]
                - [systemctl, status, NetworkManager]
                
                # Cleanup some logs
                - [truncate, '-s', '0', '/var/log/audit/audit.log']
                
                # Add logic to truly disable SELinux if disable_selinux = true.
                # We'll do it by appending to cloudinit_runcmd_common.
                
                
                
                
                # Configure default routes based on public ip availability
                # Standard setup: eth0 is public, configure both IPv4 and IPv6
                - [ip, route, add, default, via, '172.31.1.1', dev, 'eth0', metric, '100']
                - [ip, -6, route, add, default, via, 'fe80::1', dev, 'eth0', metric, '100']
            EOT
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-agent-small-1"].hcloud_server.server[0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_server" "server" {
        id                         = "101380064"
        name                       = "kube-baphomet-agent-small-1-khz"
        [90m# (22 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.0.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11230579
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["0-0-agent-small-1"].hcloud_server_network.server[0][0m will be [1m[31mdestroyed[0m
  # (because hcloud_server_network.server is not in configuration)
[0m  [31m-[0m[0m resource "hcloud_server_network" "server" {
      [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
      [31m-[0m[0m id          = "101380064-11230579" [90m-> null[0m[0m
      [31m-[0m[0m ip          = "10.0.0.101" [90m-> null[0m[0m
      [31m-[0m[0m mac_address = "86:00:00:b3:52:43" [90m-> null[0m[0m
      [31m-[0m[0m server_id   = 101380064 [90m-> null[0m[0m
      [31m-[0m[0m subnet_id   = "11230579-10.0.0.0/16" [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["1-0-agent-medium-1"].data.cloudinit_config.config[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                            >&2 echo "loop"
                            if (( "$SECONDS" > "$END_SECONDS" )); then
                                >&2 echo "timeout reached"
                                exit 1
                            fi
                            # run command and check return code
                            if $@ ; then
                                >&2 echo "break"
                                break
                            else
                                >&2 echo "got failure exit code, repeating"
                                sleep 0.5
                            fi
                        done
                    }
                
                    myrename () {
                        local eth="$1"
                        local eth_connection
                
                        # In case of a private-only network, eth0 may not exist
                        if ip link show "$eth" &>/dev/null; then
                            eth_connection=$(nmcli -g GENERAL.CONNECTION device show "$eth" || echo '')
                            nmcli connection modify "$eth_connection" \
                              con-name "$eth" \
                              connection.interface-name "$eth"
                        fi
                    }
                
                    myrepeat myrename eth0
                    myrepeat myrename eth1
                
                    systemctl restart NetworkManager
                  permissions: "0744"
                
                # Disable ssh password authentication
                - content: |
                    Port 22
                    PasswordAuthentication no
                    X11Forwarding no
                    MaxAuthTries 2
                    AllowTcpForwarding no
                    AllowAgentForwarding no
                    AuthorizedKeysFile .ssh/authorized_keys
                  path: /etc/ssh/sshd_config.d/kube-hetzner.conf
                
                # Set reboot method as "kured"
                - content: |
                    REBOOT_METHOD=kured
                  path: /etc/transactional-update.conf
                
                # Create Rancher repo config
                - content: |
                    [rancher-k3s-common-stable]
                    name=Rancher K3s Common (stable)
                    baseurl=https://rpm.rancher.io/k3s/stable/common/microos/noarch
                    enabled=1
                    gpgcheck=1
                    repo_gpgcheck=0
                    gpgkey=https://rpm.rancher.io/public.key
                  path: /etc/zypp/repos.d/rancher-k3s-common.repo
                
                # Create the kube_hetzner_selinux.te file, that allows in SELinux to not interfere with various needed services
                - path: /root/kube_hetzner_selinux.te
                  content: |
                    module kube_hetzner_selinux 1.0;
                
                    require {
                        type kernel_t, bin_t, kernel_generic_helper_t, iscsid_t, iscsid_exec_t, var_run_t, var_lib_t,
                            init_t, unlabeled_t, systemd_logind_t, systemd_hostnamed_t, container_t,
                            cert_t, container_var_lib_t, etc_t, usr_t, container_file_t, container_log_t,
                            container_share_t, container_runtime_exec_t, container_runtime_t, var_log_t, proc_t, io_uring_t, fuse_device_t, http_port_t,
                            container_var_run_t;
                        class key { read view };
                        class file { open read execute execute_no_trans create link lock rename write append setattr unlink getattr watch };
                        class sock_file { watch write create unlink };
                        class unix_dgram_socket create;
                        class unix_stream_socket { connectto read write };
                        class dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write watch };
                        class lnk_file { read create };
                        class system module_request;
                        class filesystem associate;
                        class bpf map_create;
                        class io_uring sqpoll;
                        class anon_inode { create map read write };
                        class tcp_socket name_connect;
                        class chr_file { open read write };
                    }
                
                    #============= kernel_generic_helper_t ==============
                    allow kernel_generic_helper_t bin_t:file execute_no_trans;
                    allow kernel_generic_helper_t kernel_t:key { read view };
                    allow kernel_generic_helper_t self:unix_dgram_socket create;
                
                    #============= iscsid_t ==============
                    allow iscsid_t iscsid_exec_t:file execute;
                    allow iscsid_t var_run_t:sock_file write;
                    allow iscsid_t var_run_t:unix_stream_socket connectto;
                
                    #============= init_t ==============
                    allow init_t unlabeled_t:dir { add_name remove_name rmdir search };
                    allow init_t unlabeled_t:lnk_file create;
                    allow init_t container_t:file { open read };
                    allow init_t container_file_t:file { execute execute_no_trans };
                    allow init_t fuse_device_t:chr_file { open read write };
                    allow init_t http_port_t:tcp_socket name_connect;
                
                    #============= systemd_logind_t ==============
                    allow systemd_logind_t unlabeled_t:dir search;
                
                    #============= systemd_hostnamed_t ==============
                    allow systemd_hostnamed_t unlabeled_t:dir search;
                
                    #============= container_t ==============
                    allow container_t { cert_t container_log_t }:dir read;
                    allow container_t { cert_t container_log_t }:lnk_file read;
                    allow container_t cert_t:file { read open };
                    allow container_t container_var_lib_t:dir { add_name remove_name write read create };
                    allow container_t container_var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t etc_t:dir { add_name remove_name write create setattr watch };
                    allow container_t etc_t:file { create setattr unlink write };
                    allow container_t etc_t:sock_file { create unlink };
                    allow container_t usr_t:dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write };
                    allow container_t usr_t:file { append create execute getattr link lock read rename setattr unlink write };
                    allow container_t container_file_t:file { open read write append getattr setattr lock };
                    allow container_t container_file_t:sock_file watch;
                    allow container_t container_log_t:file { open read write append getattr setattr watch };
                    allow container_t container_share_t:dir { read write add_name remove_name };
                    allow container_t container_share_t:file { read write create unlink };
                    allow container_t container_runtime_exec_t:file { read execute execute_no_trans open };
                    allow container_t container_runtime_t:unix_stream_socket { connectto read write };
                    allow container_t kernel_t:system module_request;
                    allow container_t var_log_t:dir { add_name write remove_name watch read };
                    allow container_t var_log_t:file { create lock open read setattr write unlink getattr };
                    allow container_t var_lib_t:dir { add_name remove_name write read create };
                    allow container_t var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t proc_t:filesystem associate;
                    allow container_t self:bpf map_create;
                    allow container_t self:io_uring sqpoll;
                    allow container_t io_uring_t:anon_inode { create map read write };
                    allow container_t container_var_run_t:dir { add_name remove_name write };
                    allow container_t container_var_run_t:file { create open read rename unlink write };
                
                # Create the k3s registries file if needed
                
                # Create k3s registries file
                - content: IA==
                  encoding: base64
                  path: /etc/rancher/k3s/registries.yaml
                
                
                
                # Apply DNS config
                manage_resolv_conf: true
                resolv_conf:
                  nameservers:
                    - 8.8.8.8
                    - 2606:4700:4700::1111
                
                # Add ssh authorized keys
                ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKC6jxq2Lbiwe4cjcB8itTmh4a6ldDR2KVGSM2PvrZwb sandro@DESKTOP-E6TGITL
                
                # Resize /var, not /, as that's the last partition in MicroOS image.
                growpart:
                    devices: ["/var"]
                
                # Make sure the hostname is set correctly
                hostname: kube-baphomet-agent-medium-1-xsm
                preserve_hostname: true
                
                runcmd:
                
                # ensure that /var uses full available disk size, thanks to btrfs this is easy
                - [btrfs, 'filesystem', 'resize', 'max', '/var']
                
                # SELinux permission for the SSH alternative port
                
                
                # Create and apply the necessary SELinux module for kube-hetzner
                - [checkmodule, '-M', '-m', '-o', '/root/kube_hetzner_selinux.mod', '/root/kube_hetzner_selinux.te']
                - ['semodule_package', '-o', '/root/kube_hetzner_selinux.pp', '-m', '/root/kube_hetzner_selinux.mod']
                - [semodule, '-i', '/root/kube_hetzner_selinux.pp']
                - [setsebool, '-P', 'virt_use_samba', '1']
                - [setsebool, '-P', 'domain_kernel_load_modules', '1']
                
                # Disable rebootmgr service as we use kured instead
                - [systemctl, disable, '--now', 'rebootmgr.service']
                
                # Bounds the amount of logs that can survive on the system
                - [sed, '-i', 's/#SystemMaxUse=/SystemMaxUse=3G/g', /etc/systemd/journald.conf]
                - [sed, '-i', 's/#MaxRetentionSec=/MaxRetentionSec=1week/g', /etc/systemd/journald.conf]
                
                # Reduces the default number of snapshots from 2-10 number limit, to 4 and from 4-10 number limit important, to 2
                - [sed, '-i', 's/NUMBER_LIMIT="2-10"/NUMBER_LIMIT="4"/g', /etc/snapper/configs/root]
                - [sed, '-i', 's/NUMBER_LIMIT_IMPORTANT="4-10"/NUMBER_LIMIT_IMPORTANT="3"/g', /etc/snapper/configs/root]
                
                # Allow network interface
                - [chmod, '+x', '/etc/cloud/rename_interface.sh']
                
                # Restart the sshd service to apply the new config
                - [systemctl, 'restart', 'sshd']
                
                # Make sure the network is up
                - [systemctl, restart, NetworkManager]
                - [systemctl, status, NetworkManager]
                
                # Cleanup some logs
                - [truncate, '-s', '0', '/var/log/audit/audit.log']
                
                # Add logic to truly disable SELinux if disable_selinux = true.
                # We'll do it by appending to cloudinit_runcmd_common.
                
                
                
                
                # Configure default routes based on public ip availability
                # Standard setup: eth0 is public, configure both IPv4 and IPv6
                - [ip, route, add, default, via, '172.31.1.1', dev, 'eth0', metric, '100']
                - [ip, -6, route, add, default, via, 'fe80::1', dev, 'eth0', metric, '100']
            EOT
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-agent-medium-1"].hcloud_server.server[0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_server" "server" {
        id                         = "101380404"
        name                       = "kube-baphomet-agent-medium-1-xsm"
        [90m# (22 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.1.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11230579
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["1-0-agent-medium-1"].hcloud_server_network.server[0][0m will be [1m[31mdestroyed[0m
  # (because hcloud_server_network.server is not in configuration)
[0m  [31m-[0m[0m resource "hcloud_server_network" "server" {
      [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
      [31m-[0m[0m id          = "101380404-11230579" [90m-> null[0m[0m
      [31m-[0m[0m ip          = "10.1.0.101" [90m-> null[0m[0m
      [31m-[0m[0m mac_address = "86:00:00:b3:52:44" [90m-> null[0m[0m
      [31m-[0m[0m server_id   = 101380404 [90m-> null[0m[0m
      [31m-[0m[0m subnet_id   = "11230579-10.1.0.0/16" [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["2-0-agent-large-1"].data.cloudinit_config.config[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                            >&2 echo "loop"
                            if (( "$SECONDS" > "$END_SECONDS" )); then
                                >&2 echo "timeout reached"
                                exit 1
                            fi
                            # run command and check return code
                            if $@ ; then
                                >&2 echo "break"
                                break
                            else
                                >&2 echo "got failure exit code, repeating"
                                sleep 0.5
                            fi
                        done
                    }
                
                    myrename () {
                        local eth="$1"
                        local eth_connection
                
                        # In case of a private-only network, eth0 may not exist
                        if ip link show "$eth" &>/dev/null; then
                            eth_connection=$(nmcli -g GENERAL.CONNECTION device show "$eth" || echo '')
                            nmcli connection modify "$eth_connection" \
                              con-name "$eth" \
                              connection.interface-name "$eth"
                        fi
                    }
                
                    myrepeat myrename eth0
                    myrepeat myrename eth1
                
                    systemctl restart NetworkManager
                  permissions: "0744"
                
                # Disable ssh password authentication
                - content: |
                    Port 22
                    PasswordAuthentication no
                    X11Forwarding no
                    MaxAuthTries 2
                    AllowTcpForwarding no
                    AllowAgentForwarding no
                    AuthorizedKeysFile .ssh/authorized_keys
                  path: /etc/ssh/sshd_config.d/kube-hetzner.conf
                
                # Set reboot method as "kured"
                - content: |
                    REBOOT_METHOD=kured
                  path: /etc/transactional-update.conf
                
                # Create Rancher repo config
                - content: |
                    [rancher-k3s-common-stable]
                    name=Rancher K3s Common (stable)
                    baseurl=https://rpm.rancher.io/k3s/stable/common/microos/noarch
                    enabled=1
                    gpgcheck=1
                    repo_gpgcheck=0
                    gpgkey=https://rpm.rancher.io/public.key
                  path: /etc/zypp/repos.d/rancher-k3s-common.repo
                
                # Create the kube_hetzner_selinux.te file, that allows in SELinux to not interfere with various needed services
                - path: /root/kube_hetzner_selinux.te
                  content: |
                    module kube_hetzner_selinux 1.0;
                
                    require {
                        type kernel_t, bin_t, kernel_generic_helper_t, iscsid_t, iscsid_exec_t, var_run_t, var_lib_t,
                            init_t, unlabeled_t, systemd_logind_t, systemd_hostnamed_t, container_t,
                            cert_t, container_var_lib_t, etc_t, usr_t, container_file_t, container_log_t,
                            container_share_t, container_runtime_exec_t, container_runtime_t, var_log_t, proc_t, io_uring_t, fuse_device_t, http_port_t,
                            container_var_run_t;
                        class key { read view };
                        class file { open read execute execute_no_trans create link lock rename write append setattr unlink getattr watch };
                        class sock_file { watch write create unlink };
                        class unix_dgram_socket create;
                        class unix_stream_socket { connectto read write };
                        class dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write watch };
                        class lnk_file { read create };
                        class system module_request;
                        class filesystem associate;
                        class bpf map_create;
                        class io_uring sqpoll;
                        class anon_inode { create map read write };
                        class tcp_socket name_connect;
                        class chr_file { open read write };
                    }
                
                    #============= kernel_generic_helper_t ==============
                    allow kernel_generic_helper_t bin_t:file execute_no_trans;
                    allow kernel_generic_helper_t kernel_t:key { read view };
                    allow kernel_generic_helper_t self:unix_dgram_socket create;
                
                    #============= iscsid_t ==============
                    allow iscsid_t iscsid_exec_t:file execute;
                    allow iscsid_t var_run_t:sock_file write;
                    allow iscsid_t var_run_t:unix_stream_socket connectto;
                
                    #============= init_t ==============
                    allow init_t unlabeled_t:dir { add_name remove_name rmdir search };
                    allow init_t unlabeled_t:lnk_file create;
                    allow init_t container_t:file { open read };
                    allow init_t container_file_t:file { execute execute_no_trans };
                    allow init_t fuse_device_t:chr_file { open read write };
                    allow init_t http_port_t:tcp_socket name_connect;
                
                    #============= systemd_logind_t ==============
                    allow systemd_logind_t unlabeled_t:dir search;
                
                    #============= systemd_hostnamed_t ==============
                    allow systemd_hostnamed_t unlabeled_t:dir search;
                
                    #============= container_t ==============
                    allow container_t { cert_t container_log_t }:dir read;
                    allow container_t { cert_t container_log_t }:lnk_file read;
                    allow container_t cert_t:file { read open };
                    allow container_t container_var_lib_t:dir { add_name remove_name write read create };
                    allow container_t container_var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t etc_t:dir { add_name remove_name write create setattr watch };
                    allow container_t etc_t:file { create setattr unlink write };
                    allow container_t etc_t:sock_file { create unlink };
                    allow container_t usr_t:dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write };
                    allow container_t usr_t:file { append create execute getattr link lock read rename setattr unlink write };
                    allow container_t container_file_t:file { open read write append getattr setattr lock };
                    allow container_t container_file_t:sock_file watch;
                    allow container_t container_log_t:file { open read write append getattr setattr watch };
                    allow container_t container_share_t:dir { read write add_name remove_name };
                    allow container_t container_share_t:file { read write create unlink };
                    allow container_t container_runtime_exec_t:file { read execute execute_no_trans open };
                    allow container_t container_runtime_t:unix_stream_socket { connectto read write };
                    allow container_t kernel_t:system module_request;
                    allow container_t var_log_t:dir { add_name write remove_name watch read };
                    allow container_t var_log_t:file { create lock open read setattr write unlink getattr };
                    allow container_t var_lib_t:dir { add_name remove_name write read create };
                    allow container_t var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t proc_t:filesystem associate;
                    allow container_t self:bpf map_create;
                    allow container_t self:io_uring sqpoll;
                    allow container_t io_uring_t:anon_inode { create map read write };
                    allow container_t container_var_run_t:dir { add_name remove_name write };
                    allow container_t container_var_run_t:file { create open read rename unlink write };
                
                # Create the k3s registries file if needed
                
                # Create k3s registries file
                - content: IA==
                  encoding: base64
                  path: /etc/rancher/k3s/registries.yaml
                
                
                
                # Apply DNS config
                manage_resolv_conf: true
                resolv_conf:
                  nameservers:
                    - 8.8.8.8
                    - 2606:4700:4700::1111
                
                # Add ssh authorized keys
                ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKC6jxq2Lbiwe4cjcB8itTmh4a6ldDR2KVGSM2PvrZwb sandro@DESKTOP-E6TGITL
                
                # Resize /var, not /, as that's the last partition in MicroOS image.
                growpart:
                    devices: ["/var"]
                
                # Make sure the hostname is set correctly
                hostname: kube-baphomet-agent-large-1-vwm
                preserve_hostname: true
                
                runcmd:
                
                # ensure that /var uses full available disk size, thanks to btrfs this is easy
                - [btrfs, 'filesystem', 'resize', 'max', '/var']
                
                # SELinux permission for the SSH alternative port
                
                
                # Create and apply the necessary SELinux module for kube-hetzner
                - [checkmodule, '-M', '-m', '-o', '/root/kube_hetzner_selinux.mod', '/root/kube_hetzner_selinux.te']
                - ['semodule_package', '-o', '/root/kube_hetzner_selinux.pp', '-m', '/root/kube_hetzner_selinux.mod']
                - [semodule, '-i', '/root/kube_hetzner_selinux.pp']
                - [setsebool, '-P', 'virt_use_samba', '1']
                - [setsebool, '-P', 'domain_kernel_load_modules', '1']
                
                # Disable rebootmgr service as we use kured instead
                - [systemctl, disable, '--now', 'rebootmgr.service']
                
                # Bounds the amount of logs that can survive on the system
                - [sed, '-i', 's/#SystemMaxUse=/SystemMaxUse=3G/g', /etc/systemd/journald.conf]
                - [sed, '-i', 's/#MaxRetentionSec=/MaxRetentionSec=1week/g', /etc/systemd/journald.conf]
                
                # Reduces the default number of snapshots from 2-10 number limit, to 4 and from 4-10 number limit important, to 2
                - [sed, '-i', 's/NUMBER_LIMIT="2-10"/NUMBER_LIMIT="4"/g', /etc/snapper/configs/root]
                - [sed, '-i', 's/NUMBER_LIMIT_IMPORTANT="4-10"/NUMBER_LIMIT_IMPORTANT="3"/g', /etc/snapper/configs/root]
                
                # Allow network interface
                - [chmod, '+x', '/etc/cloud/rename_interface.sh']
                
                # Restart the sshd service to apply the new config
                - [systemctl, 'restart', 'sshd']
                
                # Make sure the network is up
                - [systemctl, restart, NetworkManager]
                - [systemctl, status, NetworkManager]
                
                # Cleanup some logs
                - [truncate, '-s', '0', '/var/log/audit/audit.log']
                
                # Add logic to truly disable SELinux if disable_selinux = true.
                # We'll do it by appending to cloudinit_runcmd_common.
                
                
                
                
                # Configure default routes based on public ip availability
                # Standard setup: eth0 is public, configure both IPv4 and IPv6
                - [ip, route, add, default, via, '172.31.1.1', dev, 'eth0', metric, '100']
                - [ip, -6, route, add, default, via, 'fe80::1', dev, 'eth0', metric, '100']
            EOT
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-agent-large-1"].hcloud_server.server[0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_server" "server" {
        id                         = "101380403"
        name                       = "kube-baphomet-agent-large-1-vwm"
        [90m# (22 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.2.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11230579
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["2-0-agent-large-1"].hcloud_server_network.server[0][0m will be [1m[31mdestroyed[0m
  # (because hcloud_server_network.server is not in configuration)
[0m  [31m-[0m[0m resource "hcloud_server_network" "server" {
      [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
      [31m-[0m[0m id          = "101380403-11230579" [90m-> null[0m[0m
      [31m-[0m[0m ip          = "10.2.0.101" [90m-> null[0m[0m
      [31m-[0m[0m mac_address = "86:00:00:b3:52:45" [90m-> null[0m[0m
      [31m-[0m[0m server_id   = 101380403 [90m-> null[0m[0m
      [31m-[0m[0m subnet_id   = "11230579-10.2.0.0/16" [90m-> null[0m[0m
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].data.cloudinit_config.config[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "cloudinit_config" "config" {
      [32m+[0m[0m base64_encode = true
      [32m+[0m[0m boundary      = (known after apply)
      [32m+[0m[0m gzip          = true
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m rendered      = (known after apply)

      [32m+[0m[0m part {
          [32m+[0m[0m content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                            >&2 echo "loop"
                            if (( "$SECONDS" > "$END_SECONDS" )); then
                                >&2 echo "timeout reached"
                                exit 1
                            fi
                            # run command and check return code
                            if $@ ; then
                                >&2 echo "break"
                                break
                            else
                                >&2 echo "got failure exit code, repeating"
                                sleep 0.5
                            fi
                        done
                    }
                
                    myrename () {
                        local eth="$1"
                        local eth_connection
                
                        # In case of a private-only network, eth0 may not exist
                        if ip link show "$eth" &>/dev/null; then
                            eth_connection=$(nmcli -g GENERAL.CONNECTION device show "$eth" || echo '')
                            nmcli connection modify "$eth_connection" \
                              con-name "$eth" \
                              connection.interface-name "$eth"
                        fi
                    }
                
                    myrepeat myrename eth0
                    myrepeat myrename eth1
                
                    systemctl restart NetworkManager
                  permissions: "0744"
                
                # Disable ssh password authentication
                - content: |
                    Port 22
                    PasswordAuthentication no
                    X11Forwarding no
                    MaxAuthTries 2
                    AllowTcpForwarding no
                    AllowAgentForwarding no
                    AuthorizedKeysFile .ssh/authorized_keys
                  path: /etc/ssh/sshd_config.d/kube-hetzner.conf
                
                # Set reboot method as "kured"
                - content: |
                    REBOOT_METHOD=kured
                  path: /etc/transactional-update.conf
                
                # Create Rancher repo config
                - content: |
                    [rancher-k3s-common-stable]
                    name=Rancher K3s Common (stable)
                    baseurl=https://rpm.rancher.io/k3s/stable/common/microos/noarch
                    enabled=1
                    gpgcheck=1
                    repo_gpgcheck=0
                    gpgkey=https://rpm.rancher.io/public.key
                  path: /etc/zypp/repos.d/rancher-k3s-common.repo
                
                # Create the kube_hetzner_selinux.te file, that allows in SELinux to not interfere with various needed services
                - path: /root/kube_hetzner_selinux.te
                  content: |
                    module kube_hetzner_selinux 1.0;
                
                    require {
                        type kernel_t, bin_t, kernel_generic_helper_t, iscsid_t, iscsid_exec_t, var_run_t, var_lib_t,
                            init_t, unlabeled_t, systemd_logind_t, systemd_hostnamed_t, container_t,
                            cert_t, container_var_lib_t, etc_t, usr_t, container_file_t, container_log_t,
                            container_share_t, container_runtime_exec_t, container_runtime_t, var_log_t, proc_t, io_uring_t, fuse_device_t, http_port_t,
                            container_var_run_t;
                        class key { read view };
                        class file { open read execute execute_no_trans create link lock rename write append setattr unlink getattr watch };
                        class sock_file { watch write create unlink };
                        class unix_dgram_socket create;
                        class unix_stream_socket { connectto read write };
                        class dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write watch };
                        class lnk_file { read create };
                        class system module_request;
                        class filesystem associate;
                        class bpf map_create;
                        class io_uring sqpoll;
                        class anon_inode { create map read write };
                        class tcp_socket name_connect;
                        class chr_file { open read write };
                    }
                
                    #============= kernel_generic_helper_t ==============
                    allow kernel_generic_helper_t bin_t:file execute_no_trans;
                    allow kernel_generic_helper_t kernel_t:key { read view };
                    allow kernel_generic_helper_t self:unix_dgram_socket create;
                
                    #============= iscsid_t ==============
                    allow iscsid_t iscsid_exec_t:file execute;
                    allow iscsid_t var_run_t:sock_file write;
                    allow iscsid_t var_run_t:unix_stream_socket connectto;
                
                    #============= init_t ==============
                    allow init_t unlabeled_t:dir { add_name remove_name rmdir search };
                    allow init_t unlabeled_t:lnk_file create;
                    allow init_t container_t:file { open read };
                    allow init_t container_file_t:file { execute execute_no_trans };
                    allow init_t fuse_device_t:chr_file { open read write };
                    allow init_t http_port_t:tcp_socket name_connect;
                
                    #============= systemd_logind_t ==============
                    allow systemd_logind_t unlabeled_t:dir search;
                
                    #============= systemd_hostnamed_t ==============
                    allow systemd_hostnamed_t unlabeled_t:dir search;
                
                    #============= container_t ==============
                    allow container_t { cert_t container_log_t }:dir read;
                    allow container_t { cert_t container_log_t }:lnk_file read;
                    allow container_t cert_t:file { read open };
                    allow container_t container_var_lib_t:dir { add_name remove_name write read create };
                    allow container_t container_var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t etc_t:dir { add_name remove_name write create setattr watch };
                    allow container_t etc_t:file { create setattr unlink write };
                    allow container_t etc_t:sock_file { create unlink };
                    allow container_t usr_t:dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write };
                    allow container_t usr_t:file { append create execute getattr link lock read rename setattr unlink write };
                    allow container_t container_file_t:file { open read write append getattr setattr lock };
                    allow container_t container_file_t:sock_file watch;
                    allow container_t container_log_t:file { open read write append getattr setattr watch };
                    allow container_t container_share_t:dir { read write add_name remove_name };
                    allow container_t container_share_t:file { read write create unlink };
                    allow container_t container_runtime_exec_t:file { read execute execute_no_trans open };
                    allow container_t container_runtime_t:unix_stream_socket { connectto read write };
                    allow container_t kernel_t:system module_request;
                    allow container_t var_log_t:dir { add_name write remove_name watch read };
                    allow container_t var_log_t:file { create lock open read setattr write unlink getattr };
                    allow container_t var_lib_t:dir { add_name remove_name write read create };
                    allow container_t var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t proc_t:filesystem associate;
                    allow container_t self:bpf map_create;
                    allow container_t self:io_uring sqpoll;
                    allow container_t io_uring_t:anon_inode { create map read write };
                    allow container_t container_var_run_t:dir { add_name remove_name write };
                    allow container_t container_var_run_t:file { create open read rename unlink write };
                
                # Create the k3s registries file if needed
                
                # Create k3s registries file
                - content: IA==
                  encoding: base64
                  path: /etc/rancher/k3s/registries.yaml
                
                
                
                # Apply DNS config
                manage_resolv_conf: true
                resolv_conf:
                  nameservers:
                    - 8.8.8.8
                    - 2606:4700:4700::1111
                
                # Add ssh authorized keys
                ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKC6jxq2Lbiwe4cjcB8itTmh4a6ldDR2KVGSM2PvrZwb sandro@DESKTOP-E6TGITL
                
                # Resize /var, not /, as that's the last partition in MicroOS image.
                growpart:
                    devices: ["/var"]
                
                # Make sure the hostname is set correctly
                hostname: kube-baphomet-control-plane-fsn1-rmz
                preserve_hostname: true
                
                runcmd:
                
                # ensure that /var uses full available disk size, thanks to btrfs this is easy
                - [btrfs, 'filesystem', 'resize', 'max', '/var']
                
                # SELinux permission for the SSH alternative port
                
                
                # Create and apply the necessary SELinux module for kube-hetzner
                - [checkmodule, '-M', '-m', '-o', '/root/kube_hetzner_selinux.mod', '/root/kube_hetzner_selinux.te']
                - ['semodule_package', '-o', '/root/kube_hetzner_selinux.pp', '-m', '/root/kube_hetzner_selinux.mod']
                - [semodule, '-i', '/root/kube_hetzner_selinux.pp']
                - [setsebool, '-P', 'virt_use_samba', '1']
                - [setsebool, '-P', 'domain_kernel_load_modules', '1']
                
                # Disable rebootmgr service as we use kured instead
                - [systemctl, disable, '--now', 'rebootmgr.service']
                
                # Bounds the amount of logs that can survive on the system
                - [sed, '-i', 's/#SystemMaxUse=/SystemMaxUse=3G/g', /etc/systemd/journald.conf]
                - [sed, '-i', 's/#MaxRetentionSec=/MaxRetentionSec=1week/g', /etc/systemd/journald.conf]
                
                # Reduces the default number of snapshots from 2-10 number limit, to 4 and from 4-10 number limit important, to 2
                - [sed, '-i', 's/NUMBER_LIMIT="2-10"/NUMBER_LIMIT="4"/g', /etc/snapper/configs/root]
                - [sed, '-i', 's/NUMBER_LIMIT_IMPORTANT="4-10"/NUMBER_LIMIT_IMPORTANT="3"/g', /etc/snapper/configs/root]
                
                # Allow network interface
                - [chmod, '+x', '/etc/cloud/rename_interface.sh']
                
                # Restart the sshd service to apply the new config
                - [systemctl, 'restart', 'sshd']
                
                # Make sure the network is up
                - [systemctl, restart, NetworkManager]
                - [systemctl, status, NetworkManager]
                
                # Cleanup some logs
                - [truncate, '-s', '0', '/var/log/audit/audit.log']
                
                # Add logic to truly disable SELinux if disable_selinux = true.
                # We'll do it by appending to cloudinit_runcmd_common.
                
                
                
                
                # Configure default routes based on public ip availability
                # Standard setup: eth0 is public, configure both IPv4 and IPv6
                - [ip, route, add, default, via, '172.31.1.1', dev, 'eth0', metric, '100']
                - [ip, -6, route, add, default, via, 'fe80::1', dev, 'eth0', metric, '100']
            EOT
          [32m+[0m[0m content_type = "text/cloud-config"
          [32m+[0m[0m filename     = "init.cfg"
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].hcloud_server.server[0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_server" "server" {
        id                         = "101380061"
        name                       = "kube-baphomet-control-plane-fsn1-rmz"
        [90m# (22 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m network {
          [32m+[0m[0m alias_ips   = []
          [32m+[0m[0m ip          = "10.255.0.101"
          [32m+[0m[0m mac_address = (known after apply)
          [32m+[0m[0m network_id  = 11230579
        }

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-fsn1"].hcloud_server_network.server[0][0m will be [1m[31mdestroyed[0m
  # (because hcloud_server_network.server is not in configuration)
[0m  [31m-[0m[0m resource "hcloud_server_network" "server" {
      [31m-[0m[0m alias_ips   = [] [90m-> null[0m[0m
      [31m-[0m[0m id          = "101380061-11230579" [90m-> null[0m[0m
      [31m-[0m[0m ip          = "10.255.0.101" [90m-> null[0m[0m
      [31m-[0m[0m mac_address = "86:00:00:b3:52:86" [90m-> null[0m[0m
      [31m-[0m[0m server_id   = 101380061 [90m-> null[0m[0m
      [31m-[0m[0m subnet_id   = "11230579-10.255.0.0/16" [90m-> null[0m[0m
    }

[1mPlan:[0m 5 to add, 4 to change, 6 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m kubeconfig = (sensitive value)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>

*Pushed by: @muchasxmaracas, Action: `pull_request`*